Examinator/src/Catalogs/ФайлыСУЗ/ФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФайлыСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>FlashВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FlashЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выравнивать</name>
    <type>
      <types>EnumRef.СпособыВыравниванияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоСсылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьВнешнимПриложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайловСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьОбработкуБезопасно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументовСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ФайлыСУЗ/Forms/ФормаЭлемента/Module.bsl
#Область ПеременныеФормы

// ПЕРЕМЕННЫЕ МОДУЛЯ

&НаКлиенте
Перем ТипОбъектаНаКлиенте; // Тип объекта метаданных в виде строки

&НаСервере
Перем ТипОбъектаНаСервере; // Тип объекта метаданных в виде строки

&НаКлиенте
Перем ПерейтиКФормеРесурсаПередЗакрытием;

&НаКлиенте
Перем ПерейтиКФормеРесурсаПриЗакрытии;

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Определяем родителя ресурса
	
	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	Подборка          = Параметры.Подборка;
	РодительРесурса   = Параметры.РодительРесурса;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	ЭлементПодборки   = Параметры.ЭлементПодборки;
	
	Если НЕ ЗначениеЗаполнено(РодительРесурса) Тогда
		
		Если ЗначениеЗаполнено(Параметры.Подборка) Тогда
			РодительРесурса = Справочники.ПодборкиСУЗ.ГруппаПодчиненныхЭлементов(Параметры.Подборка, "СправочникСсылка.РесурсыСУЗ", Параметры.ЭлектронныйРесурс);
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
			РодительРесурса = Справочники.СводыЗнанийСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(Параметры.ЭлектронныйРесурс, "СправочникСсылка.РесурсыСУЗ");
		КонецЕсли;
		
	КонецЕсли;
	
	// Получаем доп. реквизиты
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		ПоказыватьДополнительныеТипыФайлов = ДанныеНастроек.Получить("ПоказыватьДополнительныеТипыФайлов");
	КонецЕсли;
	
	ПоказатьДоступныеФорматыВидео();
	
	// Загружаем версию
	
	ЗагрузитьВерсиюНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
	
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);
	
	ЕстьПоддержкаАвтоМиниатюр = Истина;
	
	#Если ВебКлиент Тогда
		
	ЕстьПоддержкаАвтоМиниатюр = Ложь;	
	
	#Иначе	
		
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Если СистемнаяИнформация.ТипПлатформы <> ТипПлатформы.Windows_x86 И СистемнаяИнформация.ТипПлатформы <> ТипПлатформы.Windows_x86_64 Тогда		
		ЕстьПоддержкаАвтоМиниатюр = Ложь;
	КонецЕсли;
	
	#КонецЕсли
	
	Элементы.АвтоМиниатюра.Видимость = ЕстьПоддержкаАвтоМиниатюр;
	Элементы.АвтоРазмерВидео.Видимость = ЕстьПоддержкаАвтоМиниатюр;
	Элементы.НеСоздаватьМиниатюруПриЗагрузкеФайла.Видимость = ЕстьПоддержкаАвтоМиниатюр;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ПерейтиКФормеРесурсаПередЗакрытием Тогда
		ПерейтиКФормеРесурсаПриЗакрытии = Истина;
	Иначе
		ПерейтиКФормеРесурсаПриЗакрытии = Ложь;
	КонецЕсли;
	
	ПерейтиКФормеРесурсаПередЗакрытием = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если ПерейтиКФормеРесурсаПриЗакрытии Тогда
		ПараметрыФормы =  Новый Структура("Ключ, РежимВыбора, ОткрытьФормуРесурса, ЭлектронныйРесурс, Подборка, ЭлементПодборки, ЭлементСодержания", Объект.Владелец, РежимВыбора, Истина, ЭлектронныйРесурс, Подборка, ЭлементПодборки, ЭлементСодержания);
		ОткрытьФорму("Справочник.РесурсыСУЗ.ФормаОбъекта", ПараметрыФормы, ВладелецФормы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(РодительРесурса) Тогда
		ПараметрыЗаписи.Вставить("РодительРесурса", РодительРесурса);
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая()
		И НЕ ЗначениеЗаполнено(АдресХраненияЗагруженногоФайла)
		И НЕ Объект.ВнешнийФайл Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данные файла не загружены'"),, "Статус",, Отказ);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого Параметр Из ПараметрыЗаписи Цикл
		ТекущийОбъект.ДополнительныеСвойства.Вставить(Параметр.Ключ, Параметр.Значение);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Записываем данные файла
	
	РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, Описание, "Описание", "ТекстовыеДанные");

	Если ЗначениеЗаполнено(АдресХраненияЗагруженногоФайла) Тогда // Сохраняем данные файла
		
		// Нужно помнить, что сохранять данные необходимо после сохранения информации о версии.
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХраненияЗагруженногоФайла);
		
		РазработкаСУЗ.СохранитьДвоичныеДанныеФайла(ТекущийОбъект, ДвоичныеДанные);
		
		Статус = НСтр("ru = 'Данные записаны в базу данных ("+ ДвоичныеДанные.Размер() +" байт)'", "ru");
		
		УдалитьИзВременногоХранилища(АдресХраненияЗагруженногоФайла); 
		
		АдресХраненияЗагруженногоФайла = "";
		
	КонецЕсли;
	
	// Записываем миниатюру
	
	Если ЗначениеЗаполнено(АдресМиниатюры) И ЭтоАдресВременногоХранилища(АдресМиниатюры) Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресМиниатюры);
		
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ДвоичныеДанные, "Миниатюра", "ДвоичныеДанные",,,"jpg");
		
	КонецЕсли;
	
	// Удаляем миниатюру	
	
	Если НЕ ЗначениеЗаполнено(АдресМиниатюры) Тогда
		
		РазработкаСУЗ.УдалитьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, "Миниатюра");
		
	КонецЕсли;
	
	// Обновляем элементы формы
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
	// Обновляем элементы
	
	Если ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания);
	КонецЕсли;

	Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
		Справочники.ЭлементыПодборкиСУЗ.Перезаписать(ЭлементПодборки);	
	КонецЕсли;	
		
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РазработкаСУЗ.ПоказатьКоличествоВерсийОбъектаНаФорме(ЭтотОбъект, ТекущийОбъект);
	
	ПоказатьДоступныеФорматыВидео();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	Оповестить("РесурсЗаписан", Объект.Владелец, ЭтотОбъект); // Всегда
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подборка) Тогда
		Оповестить("ПодборкаОбновлена", Подборка, ЭтотОбъект);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненаКонвертацияВидео" И Параметр = Объект.Ссылка
		ИЛИ НЕ ЗначениеЗаполнено(Параметр) Тогда
		
		ПоказатьДоступныеФорматыВидео();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипФайлаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда 
		УстановитьАвтоНаименование();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнешнийФайлПриИзменении(Элемент)
	Объект.ИмяФайла = ""; // Очищаем имя файла
	УстановитьДоступностьЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьДополнительныеТипыФайловПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	
	Элементы.ГруппаКомандыУправленияРазмером.Доступность = ?(ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Ширина)
		И ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Высота), Истина, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)
	
	Элементы.ГруппаКомандыУправленияРазмером.Доступность = ?(ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Ширина)
		И ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Высота), Истина, Ложь);
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура АрхивВерсий(Команда)
	РазработкаСУЗКлиент.ОткрытьВерсииОбъекта(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВерсию(Команда)
	
	АдресХраненияЗагруженногоФайла = ПоместитьДанныеФайлаВоВременноеХранилище(Объект, УникальныйИдентификатор);
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресМиниатюры) Тогда
		АдресМиниатюры = ПоместитьДанныеМиниатюрыВоВременноеХранилище(Объект, УникальныйИдентификатор);
	КонецЕсли;
	
	Статус = НСтр("ru = 'Данные предыдущей версии скопированы во временное хранилище'", "ru");
	СтруктураНовойВерсии = РазработкаСУЗ.ПолучитьСтруктуруНовойВерсииОбъекта(Объект, ТипОбъектаНаКлиенте);
	РазработкаСУЗКлиент.СоздатьВерсиюОбъекта(ЭтотОбъект, СтруктураНовойВерсии);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжениеЗагрузкиФайла", ЭтотОбъект);		
		
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеЗагрузкиФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат ИЛИ НЕ ЗначениеЗаполнено(ВыбранноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	АдресХраненияЗагруженногоФайла = Адрес; // Сохраняем в реквизите
	Статус = НСтр("ru = 'Данные помещены во временное хранилище'", "ru");
	
	СтруктураФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыбранноеИмяФайла);
	
		
	Если Объект.Ссылка.Пустая() Тогда
	
		Объект.ИмяФайла = СтруктураФайла.Имя;
	
		Объект.ТипФайла = РазработкаСУЗКлиентСервер.ПолучитьТипФайлаПоРасширению(СтруктураФайла.Расширение);
	
		Если  Объект.ТипФайла = ПредопределенноеЗначение("Перечисление.ТипыФайловСУЗ.Default")
			И НЕ РазработкаСУЗ.ЭтоФайлHTML(СтруктураФайла.Расширение) Тогда
			
			Объект.ОткрыватьВнешнимПриложением = Истина;
			
		КонецЕсли;
	
		УстановитьАвтоНаименование();
		
	Иначе
		
		СтараяСтруктураФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Объект.ИмяФайла);
		
		Если НРег(СтруктураФайла.Расширение) <> НРег(СтараяСтруктураФайла.Расширение) Тогда
			
			Оповещение = Новый ОписаниеОповещения("ОбновитьИмяИТипФайла", ЭтотОбъект, СтруктураФайла);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Расширение файла изменилось. Установить новое имя и тип файла?';"), РежимДиалогаВопрос.ДаНет, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьПоддержкаАвтоМиниатюр И Объект.ТипФайла = ПредопределенноеЗначение("Перечисление.ТипыФайловСУЗ.Video") Тогда
		
		РабочийКаталогРаботыСВидео = Неопределено;

		Если НЕ НеСоздаватьМиниатюруПриЗагрузкеФайла Тогда
			
			Если РабочийКаталогРаботыСВидео = Неопределено Тогда
				РабочийКаталогРаботыСВидео = РазработкаСУЗКлиент.ИнициализироватьРабочийКаталогРаботыСВидео();
			КонецЕсли;
			
			ДвоичныеДанныеМиниатюры = РазработкаСУЗКлиент.ДвоичныеДанныеМиниатюрыВидео(ВыбранноеИмяФайла, РабочийКаталогРаботыСВидео);
			
			Если ДвоичныеДанныеМиниатюры <> Неопределено Тогда
				АдресМиниатюры = ПоместитьВоВременноеХранилище(ДвоичныеДанныеМиниатюры, УникальныйИдентификатор);
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ширина) И НЕ ЗначениеЗаполнено(Объект.Высота) Тогда
			
			Если РабочийКаталогРаботыСВидео = Неопределено Тогда
				РабочийКаталогРаботыСВидео = РазработкаСУЗКлиент.ИнициализироватьРабочийКаталогРаботыСВидео();
			КонецЕсли;			
			
			РазмерВидеоСтруктура = РазработкаСУЗКлиент.РазмерВидео(ВыбранноеИмяФайла, РабочийКаталогРаботыСВидео); 
			
			Объект.Ширина = РазмерВидеоСтруктура.Ширина;
			Объект.Высота = РазмерВидеоСтруктура.Высота;
			
		КонецЕсли;
		
		Если РабочийКаталогРаботыСВидео <> Неопределено Тогда
			
			Попытка
				УдалитьФайлы(РабочийКаталогРаботыСВидео);
			Исключение		
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИмяИТипФайла(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Объект.ИмяФайла = Параметры.Имя;

	Объект.ТипФайла = РазработкаСУЗКлиентСервер.ПолучитьТипФайлаПоРасширению(Параметры.Расширение);

	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Имя файла не задано'", "ru"));
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресХраненияЗагруженногоФайла) Тогда
		
		ПолучитьФайл(АдресХраненияЗагруженногоФайла, Объект.ИмяФайла, Истина);
		
	Иначе
		
		Если Объект.Ссылка.Пустая() Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Данные не записаны'", "ru"));
			Возврат;
		КонецЕсли;
	
		АдресДанных = АдресДанныхФайла(Объект.Ссылка, Объект.Поставщик, Объект.Версия, УникальныйИдентификатор);
		
		ПолучитьФайл(АдресДанных, Объект.ИмяФайла, Истина);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАвтоНаименование(Команда=Неопределено)
	
	Если ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		Файл = Новый Файл(Объект.ИмяФайла);
		Объект.Наименование = Строка(Файл.ИмяБезРасширения);
	Иначе
		Объект.Наименование = "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВФормуРесурса(Команда)
	
	ПерейтиКФормеРесурсаПередЗакрытием = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматыВидео(Команда)
	
	Отказ = Ложь;
	
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ, Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ФайлыСУЗ.Форма.ФормаКонвертерВидео", Новый Структура("Файл, Версия, Поставщик", Объект.Ссылка, Объект.Версия, Объект.Поставщик), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМиниатюру(Команда)	
		
	ДиалогВыбораКартинки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораКартинки.Заголовок = НСтр("ru = 'Выберите картинку миниатюры'");
	ДиалогВыбораКартинки.МножественныйВыбор = Ложь;
	ДиалогВыбораКартинки.Фильтр = "Картинка(*.jpg;*.jpeg)|*.jpg;*.jpeg";
	ДиалогВыбораКартинки.ПредварительныйПросмотр = Истина;
	
	ОписаниеОповещенияПолученияКартинки = Новый ОписаниеОповещения("ЗагрузитьМиниатюруПродолжение", ЭтотОбъект);
	
	НачатьПомещениеФайлов(ОписаниеОповещенияПолученияКартинки,, ДиалогВыбораКартинки, Истина, УникальныйИдентификатор);	
	
КонецПроцедуры

// Продолжение процедуры (см. выше).
// 
&НаКлиенте
Процедура ЗагрузитьМиниатюруПродолжение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресМиниатюры = ПолученныеФайлы[0].Хранение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоМиниатюра(Команда)
	
	АдресФайла = Неопределено;
	
	Если ЗначениеЗаполнено(АдресХраненияЗагруженногоФайла) И ЭтоАдресВременногоХранилища(АдресХраненияЗагруженногоФайла) Тогда
		АдресФайла = АдресХраненияЗагруженногоФайла;
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АдресФайла = ПоместитьДанныеФайлаВоВременноеХранилище(Объект, УникальныйИдентификатор);
	КонецЕсли;
	
	Если АдресФайла = Неопределено ИЛИ НЕ ЭтоАдресВременногоХранилища(АдресФайла) ИЛИ НЕ ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Двоичные данные файла не найдены'"));
		Возврат;
	КонецЕсли;
	
	РабочийКаталогСозданияМиниатюр = РазработкаСУЗКлиент.ИнициализироватьРабочийКаталогРаботыСВидео();
	
	// Используются синхронные методы, так как возможность работает только в тонком клиенте
	
	ПутьКФайлуВидео = РабочийКаталогСозданияМиниатюр + Объект.ИмяФайла;
	
	ПолучитьФайл(АдресФайла, ПутьКФайлуВидео, Ложь); 
	
	ДвоичныеДанныеМиниатюры = РазработкаСУЗКлиент.ДвоичныеДанныеМиниатюрыВидео(ПутьКФайлуВидео, РабочийКаталогСозданияМиниатюр);
	
	Попытка
		УдалитьФайлы(РабочийКаталогСозданияМиниатюр);
	Исключение		
	КонецПопытки;
	
	Если ДвоичныеДанныеМиниатюры <> Неопределено Тогда
		АдресМиниатюры = ПоместитьВоВременноеХранилище(ДвоичныеДанныеМиниатюры, УникальныйИдентификатор);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМиниатюру(Команда)
	
	АдресМиниатюры = Неопределено;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьРазмерыПропорционально(Команда)
	ИзменитьРазмерыПропорционально(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазмерыПропорционально(Команда)
	ИзменитьРазмерыПропорционально(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура АвтоРазмерВидео(Команда)
	
	АдресФайла = Неопределено;
	
	Если ЗначениеЗаполнено(АдресХраненияЗагруженногоФайла) И ЭтоАдресВременногоХранилища(АдресХраненияЗагруженногоФайла) Тогда
		АдресФайла = АдресХраненияЗагруженногоФайла;
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
		АдресФайла = ПоместитьДанныеФайлаВоВременноеХранилище(Объект, УникальныйИдентификатор);
	КонецЕсли;
	
	Если АдресФайла = Неопределено ИЛИ НЕ ЭтоАдресВременногоХранилища(АдресФайла) ИЛИ НЕ ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Двоичные данные файла не найдены'"));
		Возврат;
	КонецЕсли;
	
	РабочийКаталогСозданияМиниатюр = РазработкаСУЗКлиент.ИнициализироватьРабочийКаталогРаботыСВидео();
	
	// Используются синхронные методы, так как возможность работает только в тонком клиенте
	
	ПутьКФайлуВидео = РабочийКаталогСозданияМиниатюр + Объект.ИмяФайла;
	
	ПолучитьФайл(АдресФайла, ПутьКФайлуВидео, Ложь); 
	
	РазмерыВидео = РазработкаСУЗКлиент.РазмерВидео(ПутьКФайлуВидео, РабочийКаталогСозданияМиниатюр);
	
	Попытка
		УдалитьФайлы(РабочийКаталогСозданияМиниатюр);
	Исключение		
	КонецПопытки;
	
	Объект.Ширина = РазмерыВидео.Ширина;
	Объект.Высота = РазмерыВидео.Высота;	
	
	Модифицированность = Истина;	
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыНаСервере()
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Элементы.ОписаниеВерсии.Заголовок = "Описание версии *";
	Иначе
		Элементы.ОписаниеВерсии.Заголовок = "Описание версии";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипФайла) Тогда
		Элементы.ГруппаНастройки.Видимость = Истина;
	Иначе
		Элементы.ГруппаНастройки.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Default Тогда
		Элементы.ГруппаНастройкиМедиаОбъекта.Видимость              = Ложь;
		Элементы.ГруппаНастройкиКартинкиМедиаобъектаВидео.Видимость = Ложь;
		Элементы.ГруппаНастройкиФайлаПоУмолчанию.Видимость          = Истина;
		Элементы.ГруппаНастройкиВидео.Видимость                     = Ложь;
		Элементы.ГруппаНастройкиВнешнейОбработки.Видимость          = Ложь;
		Элементы.ГруппаФорматыВидео.Видимость                       = Ложь;		
		Элементы.ГруппаКомандыРазмерыВидео.Видимость                = Ложь;		
	КонецЕсли;
	
	Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.DataProcessor Тогда
		Элементы.ГруппаНастройкиМедиаОбъекта.Видимость              = Ложь;
		Элементы.ГруппаНастройкиКартинкиМедиаобъектаВидео.Видимость = Ложь;
		Элементы.ГруппаНастройкиФайлаПоУмолчанию.Видимость          = Ложь;
		Элементы.ГруппаНастройкиВидео.Видимость                     = Ложь;
		Элементы.ГруппаНастройкиВнешнейОбработки.Видимость          = Истина;
		Элементы.ГруппаФорматыВидео.Видимость                       = Ложь;
		Элементы.ГруппаКомандыРазмерыВидео.Видимость                = Ложь;
	КонецЕсли;
	
	Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Media Тогда
		Элементы.ГруппаНастройкиМедиаОбъекта.Видимость              = Истина;
		Элементы.ГруппаНастройкиКартинкиМедиаобъектаВидео.Видимость = Истина;
		Элементы.ГруппаНастройкиФайлаПоУмолчанию.Видимость          = Ложь;
		Элементы.ГруппаНастройкиВидео.Видимость                     = Ложь;
		Элементы.ГруппаНастройкиВнешнейОбработки.Видимость          = Ложь;
		Элементы.ГруппаФорматыВидео.Видимость                       = Ложь;
		Элементы.ГруппаКомандыРазмерыВидео.Видимость                = Ложь;
		Элементы.ГруппаКомандыРазмерыВидео.Видимость                = Ложь;
	КонецЕсли;
	
	Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Image Тогда
		Элементы.ГруппаНастройкиМедиаОбъекта.Видимость              = Ложь;
		Элементы.ГруппаНастройкиКартинкиМедиаобъектаВидео.Видимость = Истина;
		Элементы.ГруппаНастройкиФайлаПоУмолчанию.Видимость          = Ложь;
		Элементы.ГруппаНастройкиВидео.Видимость                     = Ложь;
		Элементы.ГруппаНастройкиВнешнейОбработки.Видимость          = Ложь;
		Элементы.ГруппаФорматыВидео.Видимость                       = Ложь;
		Элементы.ГруппаКомандыРазмерыВидео.Видимость                = Ложь;
	КонецЕсли;
	
	Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Folder Тогда
		Элементы.ГруппаНастройкиМедиаОбъекта.Видимость              = Ложь;
		Элементы.ГруппаНастройкиКартинкиМедиаобъектаВидео.Видимость = Ложь;
		Элементы.ГруппаНастройкиФайлаПоУмолчанию.Видимость          = Ложь;
		Элементы.ГруппаНастройкиВидео.Видимость                     = Ложь;
		Элементы.ГруппаНастройкиВнешнейОбработки.Видимость          = Ложь;
		Элементы.ГруппаФорматыВидео.Видимость                       = Ложь;
		Элементы.ГруппаКомандыРазмерыВидео.Видимость                = Ложь;
	КонецЕсли;
	
	Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Video
		ИЛИ Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Audio Тогда
		Элементы.ГруппаНастройкиМедиаОбъекта.Видимость              = Ложь;
		Элементы.ГруппаНастройкиКартинкиМедиаобъектаВидео.Видимость = Истина;
		Элементы.ГруппаНастройкиФайлаПоУмолчанию.Видимость          = Ложь;
		Элементы.ГруппаНастройкиВидео.Видимость                     = Истина;
		Элементы.ГруппаНастройкиВнешнейОбработки.Видимость          = Ложь;
		
		Если Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Video Тогда
			Элементы.ГруппаФорматыВидео.Видимость = Истина;
			Элементы.ГруппаКомандыРазмерыВидео.Видимость = Истина;
		Иначе
			Элементы.ГруппаФорматыВидео.Видимость = Ложь;
			Элементы.ГруппаКомандыРазмерыВидео.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ОткрыватьПоСсылке.Доступность = ?(Объект.Скрывать, Ложь, Истина);	
	
	Если Объект.ВнешнийФайл Тогда
		Элементы.КоманднаяПанельУправление.Видимость = Ложь;
		Элементы.Статус.Видимость = Ложь;
	Иначе
		Элементы.КоманднаяПанельУправление.Видимость = Истина;
		Элементы.Статус.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ВнешнийФайл Тогда
		Элементы.ИмяФайла.Заголовок = "Путь";
	Иначе
		Элементы.ИмяФайла.Заголовок = "";
	КонецЕсли;
	
	// Исключаем типы файлов
	
	МассивТиповФайлов = Новый Массив();
	
	МассивТиповФайлов.Добавить(Перечисления.ТипыФайловСУЗ.Document);
	
	Если НЕ ПоказыватьДополнительныеТипыФайлов Тогда
		
		МассивТиповФайлов.Добавить(Перечисления.ТипыФайловСУЗ.DataProcessor);
		МассивТиповФайлов.Добавить(Перечисления.ТипыФайловСУЗ.Folder);
		МассивТиповФайлов.Добавить(Перечисления.ТипыФайловСУЗ.Media);		
		
	КонецЕсли;
	
	МассивПараметровВыбора = Новый Массив();
	
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ИсключитьЗначения", Новый ФиксированныйМассив(МассивТиповФайлов)));
	Элементы.ТипФайла.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	//
	
	Элементы.ФорматыВидео.Видимость = ?(Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Video, Истина, Ложь);
	
	Элементы.ГруппаМиниатюра.Видимость = ?(Объект.ТипФайла = Перечисления.ТипыФайловСУЗ.Video, Истина, Ложь);
	
	Элементы.ГруппаКомандыУправленияРазмером.Доступность = ?(ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Ширина)
		И ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Высота), Истина, Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресДанныхФайла(Ссылка, Поставщик, Версия, УникальныйИдентификатор)
	
	Возврат РегистрыСведений.ДанныеФайлыСУЗ.АдресХраненияДвоичныхДанных(Ссылка, Поставщик, Версия, "ДвоичныеДанные", УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ПоместитьДанныеФайлаВоВременноеХранилище(Знач Объект, Знач ИдентификаторФормы)
	
	ДвоичныеДанные = ОбъектыСУЗ.ПолучитьДанные(Объект.Ссылка, "ДвоичныеДанные", Ложь, "ДвоичныеДанные");
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
	
КонецФункции

&НаСервере
Функция ПоместитьДанныеМиниатюрыВоВременноеХранилище(Знач Объект, Знач ИдентификаторФормы)
	
	Если ЭтоАдресВременногоХранилища(АдресМиниатюры) Тогда
		
		Возврат АдресМиниатюры;
		
	Иначе
		
		ДвоичныеДанные  = ОбъектыСУЗ.ПолучитьДанные(Объект.Ссылка, "Миниатюра", Ложь, "ДвоичныеДанные");
		
		Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);		
		
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ПоказатьДоступныеФорматыВидео()
	
	ДоступенФорматFLV = Ложь;
	ДоступенФорматMP4 = Ложь;
	ДоступенФорматWEBM = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ФорматыВидеоФайлов = Справочники.ФайлыСУЗ.ФорматыВидеоФайлов(Объект.Ссылка, Объект.Версия, Объект.Поставщик);
	
	Если ФорматыВидеоФайлов = Неопределено
		ИЛИ ФорматыВидеоФайлов.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДоступенФорматFLV = ФорматыВидеоФайлов[0].FLV;
	ДоступенФорматMP4 = ФорматыВидеоФайлов[0].MP4;
	ДоступенФорматWEBM = ФорматыВидеоФайлов[0].WEBM;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРазмерыПропорционально(Увеличивать=Истина)
	
	Если ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Ширина)
		И ОбщегоНазначенияСУКлиентСервер.ЭтоЧисло(Объект.Высота) Тогда
		
		ШиринаЧисло = Число(Объект.Ширина);
		ВысотаЧисло = Число(Объект.Высота);
		
		Если ШиринаЧисло > 0 И ВысотаЧисло > 0 Тогда
			
			СтараяВысота = ВысотаЧисло;
			СтараяШирина = ШиринаЧисло;			
						
			Если Увеличивать Тогда				
				ШиринаЧисло = ШиринаЧисло + 10; 				
			Иначе				
				ШиринаЧисло = ШиринаЧисло - 10;				
			КонецЕсли;
			
			ВысотаЧисло = Окр(ШиринаЧисло * (СтараяВысота / СтараяШирина), 0);
			
			Объект.Ширина = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ШиринаЧисло);
			Объект.Высота = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ВысотаЧисло);
			
			Модифицированность = Истина;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("ru = 'Невозможно определить соотношение ширины и высоты'"));
	
КонецПроцедуры

#КонецОбласти


#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
// Загружает данные текущей версии объекта для редактирования.
// Вызывается из общей формы "ВерсииОбъектаСУЗ" и после инициализации редактора.
//
Процедура ЗагрузитьВерсию() Экспорт
	
	ЗагрузитьВерсиюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВерсиюНаСервере(ПерваяЗагрузка = Ложь) Экспорт
	
	//////////////////////////////////////////////////////////////////
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект);
	//////////////////////////////////////////////////////////////////
	
	ТипОбъекта = Тип(ТипОбъектаНаСервере);
	
	РазработкаСУЗ.ПоказатьКоличествоВерсийОбъектаНаФорме(ЭтотОбъект, Объект, ТипОбъекта);
	
	Описание  = ОбъектыСУЗ.ПолучитьДанные(Объект.Ссылка, "Описание");
	
	Если НЕ ПерваяЗагрузка Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Статус = НСтр("ru = 'Данные отсутствуют'", "ru");
		
		СтруктураНовойВерсии = РазработкаСУЗ.ПолучитьСтруктуруНовойВерсииОбъекта(Объект, ТипОбъектаНаСервере);
		
		Объект.Версия    = СтруктураНовойВерсии.Версия;
		Объект.Поставщик = СтруктураНовойВерсии.Поставщик;
		
		Элементы.Поставщик.ТолькоПросмотр  = Ложь;
		Элементы.Версия.ТолькоПросмотр     = Ложь;
		Элементы.СоздатьВерсию.Доступность = Ложь;
		
	Иначе
		
		Статус = НСтр("ru = 'Данные размещены в базе данных'", "ru");
		
		Элементы.Поставщик.ТолькоПросмотр  = Истина;
		Элементы.Версия.ТолькоПросмотр     = Истина;
		Элементы.СоздатьВерсию.Доступность = Истина;
		
	КонецЕсли;
	
	АдресМиниатюры = РегистрыСведений.ДанныеФайлыСУЗ.АдресХраненияДвоичныхДанных(Объект.Ссылка, Объект.Поставщик, Объект.Версия, "Миниатюра", УникальныйИдентификатор);
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область ОператорыМодуля

// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ТипОбъектаНаКлиенте = "СправочникОбъект.ФайлыСУЗ"; 
ТипОбъектаНаСервере = "СправочникОбъект.ФайлыСУЗ";
ПерейтиКФормеРесурсаПриЗакрытии = Ложь;
ПерейтиКФормеРесурсаПередЗакрытием = Ложь;

#КонецОбласти
